{
  "title": "Enhancing PyKEEN with Multiple Negative Sampling Solutions for Knowledge Graph Embedding Models",
  "detailed_summary": "这篇论文针对知识图谱嵌入(KGE)模型中负采样策略的局限性，提出了一个针对PyKEEN框架的扩展。该扩展集成了一系列先进的负采样器，包括静态和动态corruption策略，旨在生成更有意义的负样本。论文指出，现有的KGE库通常只支持基本的负采样策略，缺乏高级解决方案。通过提供一个模块化的架构，该扩展与现有的PyKEEN工作流兼容，并简化了嵌入方法的开发和定制。作为概念验证，论文对开发的扩展进行了全面的实证研究，评估了它们对不同嵌入方法在链接预测任务上的性能影响，并为设计更有效的策略提供了有用的见解。此研究强调了负采样策略对KGE模型性能的重要影响。",
  "background": "知识图谱(KG)以图结构形式表示数据，广泛应用于知识密集型应用中。然而，KG通常是不完整的。知识图谱嵌入(KGE)模型通过将实体和关系编码到低维向量空间来解决KG补全问题。KGE模型的训练依赖于区分正样本和人工生成的负样本(NS)。高质量的负样本对于优化训练效果和模型在KG补全任务中的性能至关重要。现有的负采样方法通常采用随机corrupt正样本三元组的方式生成负样本，但这种方法可能生成低质量的负样本。尽管schema-level的知识有很高的价值和可用性，但目前schema-level的知识很少被利用，因此，探索正交组件（表示模型和负采样方法）之间的相互作用至关重要。现有的KGE软件库只支持基本的负采样策略，因此，论文旨在通过增强PyKEEN来解决这些问题。",
  "contributions": [
    "开发了一个针对PyKEEN框架的模块化扩展，集成了一系列先进的负采样策略，包括静态和动态corruption策略。",
    "提供了一个通用的、可重用的抽象实现，用于处理每个三元组的ad hoc负样本池。",
    "实现了五个新的静态负采样器：Corrupt、Typed (with domain and range)、Typed (with only entity classes)和Relational，这些采样器探索了实体选择的结构和语义标准。",
    "实现了两个动态负采样器：NearestNeighbour和Adversarial，这些采样器利用预训练的辅助模型来指导信息量更大的负样本的选择。",
    "提供了一套完整的文档，包括Python Docstrings、READMEs、Bash脚本和示例，以支持代码重用和社区采用。"
  ],
  "problem": "现有的KGE库通常只支持基本的负采样策略，缺乏高级解决方案，并且ad hoc采样技术与嵌入方法紧密耦合。生成准确的负样本是一项关键且具有挑战性的任务，因为知识图谱仅包含正面陈述（三元组）。低质量的负样本导致次优的嵌入和性能下降。",
  "methods": [
    "**静态Corruption：** 通过定义一个标准来选择候选实体的子集，用作从中抽取实体的负样本池。主要区别在于计算负样本池的逻辑。",
    "  *Random Sampling:* 将整个实体集合定义为负样本池，并随机抽取实体。",
    "  *Bernoulli Sampling:* 类似于随机抽样，但通过分析关系如何连接实体来调整corrupt头部或尾部实体的概率。",
    "  *Corrupt Sampling:* 基于出现在每个关系中的头部或尾部实体来corrupt样本，利用关系结构信息来定义可用的候选负样本三元组池。",
    "  *Typed Sampling:* 利用知识图谱中存在的强类型关系和实体，使用关系域和范围类来定义每个三元组的负样本池。",
    "  *Relational Sampling:* 假设每个头尾对仅参与一种关系，负样本池基于与其他关系相关的实体。",
    "**动态Corruption：** 利用预训练的辅助模型来指导信息量更大的负样本的选择。动态采样器利用实体和预测实体向量空间表示来查找更多信息性负样本。",
    "  *Nearest Neighbor:* 使用辅助预训练模型来生成实体的向量表示，并通过检索k个最接近头部（尾部）向量表示的实体来选择hard negatives。",
    "  *Adversarial Sampling:* 与上一种动态采样器采用完全相同的公式，但使用向量空间中的模型预测而不是实体嵌入。"
  ],
  "experimental_design": {
    "实验设置": "使用了四个数据集：YAGO4-20、WN18、DBpedia50K和FB15K。评估了每种负采样方法生成不同真实负样本的能力，并使用集成的随机负样本方法与[18]中的实验设计对齐。选择了来自三个不同类别的十二种KGE方法：(1) translation-based (TransE, TransH, TransR, and TransD), (2) semantic similarity-based (DistMult, RESCAL, ComplEx, SimplE), and (3) geometric-based (RotatE, QuatE, BoxE, HolE)。",
    "数据集": "使用了两个数据集：schema-less的WN18和带有额外schema信息的FB15K。WN18是从WordNet中提取的，FB15K是Freebase的子集。",
    "评估指标": "采用hit ratio with a cutoff value of 10 (Hit@10) 作为评估指标。评估KGE模型的性能时使用过滤标准，以防止已知的triple影响排序列表。"
  },
  "results": "实验结果表明，采样策略对模型性能的影响因数据集结构和采样设计而异。对于FB15K，Bernoulli抽样等策略在各种嵌入模型中都产生了良好的效果，而对抗性采样仍然是最无效的。在负样本池大小和链接预测指标的总体评估中，观察到增加每个正样本实例的负样本数量对性能的影响可以忽略不计，所有模型和负采样器的指标相似。",
  "result_analysis": "结果表明，采样策略对模型性能的影响因数据集结构和采样设计而异。负采样选择会对模型性能产生重大影响，应在了解数据集特征和评估目标的情况下进行。静态采样器存在局限性，需要更深入地研究负采样器如何与图结构交互并影响模型行为。当负采样器无法生成足够的候选对象时，在corruption策略中使用随机负样本的集成可以解释为什么增加每个正样本实例的负样本数量对性能的影响可以忽略不计。",
  "conclusions": "该工作介绍并验证了PyKEEN框架的模块化扩展。该扩展旨在为采用KGE方法时提供广泛的标准化的负采样器实现，从而填补了更高级实现的负采样器可用性的重要空白。具体来说，提供了一个完全兼容的静态和动态corruption策略的五个负采样器的实现。通过一系列实验证明了实用性，展示了如何将扩展无缝集成到KGE的训练、评估和超参数优化管道中。",
  "limitations": "性能优化是一个局限性，特别是在计算加速方面，缺乏缓存策略和算法。实验评估的范围有限，没有对所有采样器进行详尽的基准测试，而是侧重于验证设计和功能。",
  "future_work": "未来的发展将侧重于额外的负采样方法和更广泛的实验评估，涵盖更多样化的数据集。性能优化，特别是通过缓存策略和加速计算的算法，是一个重要的增强。还预见了并行和分布式实施的潜力。",
  "applications": "这项研究成果能够促进知识图谱嵌入模型的训练和优化，从而提升链接预测、三元组分类等下游任务的性能。更有效的知识图谱嵌入模型可以应用于推荐系统、问答系统、信息检索等多个领域，改善用户体验和系统智能化水平。",
  "related_work": "论文中提到了与负采样方法相关的一些重要文献，例如：\n* Kotnis, B., Nastase, V. (2017). Analysis of the impact of negative sampling on link prediction in knowledge graphs.\n* Bordes, A., Usunier, N., Garcia-Duran, A., Weston, J., Yakhnenko, O. (2013). Translating embeddings for modeling multi-relational data.",
  "github_links": [
    "https://github.com/ivandiliso/refactor-negative-sampler/",
    "https://ivandiliso.github.io/refactor-negative-sampler"
  ],
  "published": "2025-08-07T17:24:34+00:00"
}