{
  "title": "Towards Generalizable Safety in Crowd Navigation via Conformal Uncertainty Handling",
  "detailed_summary": "该论文提出了一种基于强化学习的轨迹规划框架，通过将一致性不确定性融入到约束强化学习（CRL）方案中，来缓解人群导航中出现的域泛化问题。该方法通过自适应一致性推理（ACI）估计行人轨迹预测的不确定性，并将其用于指导机器人的行为。该系统使用约束强化学习来规范agent的行为，使其能够适应环境的变化。在同分布设置中，该方法实现了96.93%的成功率，比之前的SOTA基线高出8.80%以上，碰撞次数减少了3.72倍，侵入真实行人未来轨迹的次数减少了2.43倍。在三种异分布场景中，该方法在速度变化、策略变化以及从个体到群体动态的转变方面表现出更强的鲁棒性。该方法部署在真实的机器人上，实验表明机器人在与稀疏和密集人群互动时都能做出安全而稳健的决策。",
  "background": "在人群中安全导航是机器人与人类紧密合作的基础。现有的强化学习方法在同分布环境中表现良好，但在异分布环境中性能急剧下降，表明存在过拟合的倾向和难以泛化到多样化的人群动态。将预测信息融入观测可以帮助机器人决策，但同时也可能加剧过拟合问题，因为现实世界中的人类动态复杂且难以完全捕捉。现有的方法缺乏对预测误差的系统处理，无法提高策略的泛化能力。",
  "contributions": [
    "提出了一种基于强化学习的轨迹规划框架，该框架集成了 conformal uncertainty 到 CRL 方案中，以减轻 OOD 性能下降。",
    "使用自适应 conformal 推理（ACI）来量化人类轨迹预测中的不确定性，并使用这些估计来通过约束强化学习指导 agent 的行为。",
    "该系统帮助规范 agent 的行为，并使其能够适应分布转移。",
    "在同分布设置中，该方法实现了 96.93% 的成功率，比之前的 SOTA 基线高出 8.80% 以上，碰撞次数减少了 3.72 倍，并且入侵地面次数减少了 2.43 倍 - 真实的未来人类轨迹。",
    "在三个 OOD 场景中，该方法在面对速度变化、策略变化以及从个体到群体动态的过渡时，表现出更强的鲁棒性。"
  ],
  "problem": "解决在人群导航中，由于强化学习方法在异分布环境中性能下降的问题，特别是在人类行为动态复杂且难以预测的情况下，如何提高机器人在面对不同人群动态时的安全性和泛化能力。",
  "methods": [
    "**自适应一致性推理 (ACI):** 使用 DtACI 动态量化轨迹预测的不确定性，为每个预测的人类轨迹生成一个预测集，该预测集包含用户定义的覆盖概率的真实未来位置。DtACI 可以在线更新其校准，因此可以在底层人群动态发生变化时快速适应。",
    "**约束强化学习 (CRL):** 使用 CRL 将有效的可控性引入决策系统，使用不确定性估计来指导学习过程和 agent 的行为。对 agent 施加约束，基于 cumulative intrusions of the robot into other agents’ uncertainty areas来引导行为，解决了稀疏约束反馈的问题。",
    "**策略网络结构:** 使用带有组合注意力机制的策略网络，处理轨迹预测结果和对应的不确定性量化，使 RL agent 能够在决策过程中考虑预测不确定性。"
  ],
  "experimental_design": "使用 CrowdNav 模拟环境，包含20个人和一个机器人在 12m x 12m 的区域内，随机初始化位置和目标位置。机器人半径为 0.2m，行人半径在 0.3m 到 0.5m 之间随机采样。评估指标包括成功率 (SR)、碰撞率 (CR)、超时率 (TR)、导航时间 (NT)、路径长度 (PL)、入侵时间比率 (ITR) 和社交距离 (SD)。",
  "results": "在同分布测试中，该方法成功率达到 96.93%，相比 SOTA 方法提升了 8.80%，碰撞次数减少了 3.72 倍，行人轨迹入侵次数减少了 2.43 倍。在速度变化、策略变化和群体行为三种 OOD 场景下，该方法保持了较高的成功率和较低的碰撞率，而其他方法性能显著下降。",
  "result_analysis": "实验结果表明，该方法通过考虑预测的不确定性，有效地提高了机器人在人群导航中的安全性和泛化能力。在 OOD 场景下，通过 ACI 动态调整不确定性区域，机器人能够更好地适应环境变化，避免碰撞。",
  "conclusions": "该论文提出了一种基于强化学习的轨迹规划框架，通过将 conformal uncertainty 集成到 CRL 方案中，减轻 OOD 性能下降。与传统的 RL 规划器相比，该方法动态地利用不确定性估计来适应速度变化、策略变化以及从个体到群体动态的过渡。大量的仿真结果表明了在不同的 OOD 场景中的稳健稳定性，而现实世界的试验证实了该方法的实际有效性。",
  "limitations": "该方法主要解决了密集人群环境中的安全导航问题，但需要额外的感知和建图能力来处理任意形状的静态障碍物。该方法对感知错误（如行人漏检和激光雷达对光照的敏感性）较为敏感，需要融合多种传感器和更高频率的激光雷达来增加安全性。虽然该策略有效地缓解了 OOD 性能下降，但并没有完全消除它，这仍然是深度学习中的一个巨大挑战。该论文只评估了三种代表性的 OOD 场景，可能的分布偏移空间很大，无法穷尽测试。",
  "future_work": "未来的研究方向包括集成 SLAM 和多模态观测到策略网络中，以处理任意形状的静态障碍物。计划增加摄像头，应用传感器融合技术，并升级到更高频率、更鲁棒的激光雷达，以缓解感知错误。采用更大的模型（如 LLM 或 VLM）和先进的对齐方法，以进一步提高 OOD 泛化能力。进行更大规模的真实世界实验。",
  "applications": "该研究成果可应用于各种需要在人群中安全导航的机器人应用，如：送货机器人、服务机器人、巡逻机器人等。通过提高机器人在复杂环境中的安全性和适应性，可以促进机器人在日常生活中的广泛应用。",
  "related_work": "论文中提到了与人群导航、不确定性规划和强化学习相关的研究工作，包括基于规则的方法、优化方法、强化学习方法和混合系统。特别强调了 SafeCrowdNav 和 CrowdNav++ 等 SOTA 的 RL 算法。",
  "github_links": [
    "https://gen-safe-nav.github.io/"
  ],
  "published": "2025-08-07T17:59:43+00:00"
}