{
  "title": "KuaiLive: A Real-time Interactive Dataset for Live Streaming Recommendation",
  "detailed_summary": "本文介绍了一个名为KuaiLive的大规模、实时的直播推荐数据集，该数据集来源于中国领先的直播平台快手，拥有超过4亿日活跃用户。该数据集记录了23772个用户和452621个主播在21天内的互动日志。KuaiLive相对于现有数据集的优势在于，它包含了精确的直播间开始和结束时间戳，多种类型的实时用户互动（点击、评论、点赞、送礼），以及用户和主播的丰富附加信息。这些特性使得能够更真实地模拟动态候选项目，并更好地建模用户和主播的行为。通过对KuaiLive的多角度分析，并评估了在该数据集上的几种代表性推荐方法，为未来的研究建立了一个强大的基准。KuaiLive支持直播领域的广泛任务，如Top-K推荐、点击率预测、观看时长预测和礼物价格预测。此外，其细粒度的行为数据也支持对多行为建模、多任务学习和公平感知推荐的研究。该数据集和相关资源已公开。",
  "background": "随着短视频和直播平台的快速发展，直播已成为一种重要的新型在线服务形式，它将实时内容广播与即时社交互动无缝结合。然而，由于缺乏公开可用的、大规模的、结构良好的数据集，学术界对直播推荐的研究明显不足。现有的公开数据集主要集中在短视频或通用内容推荐任务上，而直播推荐具有其独特的特征：主播和直播间仅在广播期间活跃，导致候选池随时间动态变化；直播内容和用户行为都在实时演变，产生复杂的、时间相关的互动模式。KuaiLive的出现是为了弥合行业实践与学术理解之间的差距，促进针对直播场景的有效和通用的推荐模型的发展。",
  "contributions": [
    "提出了 KuaiLive，一个大规模、实时的直播推荐数据集，来源于中国领先的直播平台快手。",
    "KuaiLive 包含精确的直播间开始和结束时间戳，允许研究人员模拟真实的直播推荐设置，其中候选项目受到时间约束并动态变化。",
    "KuaiLive 记录了多种用户行为（例如，点击、评论、点赞、送礼），可用于研究多任务学习和多行为建模。",
    "KuaiLive 保留了每个交互的时间顺序，支持对用户行为轨迹的细粒度分析。",
    "KuaiLive 不仅包括用户和项目 ID，还包括丰富的附加信息特征，例如人口统计数据和属性，这有助于进行特征感知建模。",
    "对数据集进行了全面的分析，揭示了直播场景的关键特征和模式",
    "在 KuaiLive 上评估了代表性的推荐方法，为未来的研究建立了基准。"
  ],
  "problem": "缺乏公开可用的、大规模的、结构良好的数据集，这阻碍了学术界对直播推荐的研究。现有的数据集未能充分捕捉直播环境的动态特性，例如直播间生命周期、多样化的用户行为和丰富的附加信息。这导致行业实践与学术理解之间存在差距，影响了专门针对直播场景的有效和通用推荐模型的发展。",
  "methods": [
    "**用户抽样:** 随机抽取约25000名活跃用户，这些用户在2025年5月5日至2025年5月25日期间在快手直播领域参与了所有四种类型的互动（点击、评论、点赞和送礼）。",
    "**互动收集:** 收集了21天内（2025年5月5日至2025年5月25日）来自直播服务日志的多种类型的细粒度用户互动，包括点击、评论、点赞和送礼四种行为类型。",
    "**附加信息收集:** 收集了所有三个核心实体（用户、主播和直播间）的广泛附加信息。",
    "**匿名化:** 应用了严格的匿名化程序，以确保符合数据发布政策并保护用户隐私。"
  ],
  "experimental_design": {
    "datasets": "使用点击行为作为实验数据。定义推荐项目为直播间或主播。",
    "evaluation_protocol": "对于Top-K推荐，采用留一法分割策略。对于CTR预测，将正负样本组合，并根据互动时间戳将数据按8:1:1的比例分为训练集、验证集和测试集。",
    "benchmarked_approaches": "对于Top-K推荐，选择通用协同过滤方法（BPRMF, NeuMF, LightGCN, DirectAU）、序列方法（GRU4Rec, SASRec, NARM, Caser）和时间感知方法（TiSASRec）。对于CTR预测，包括FM, Wide&Deep, DeepFM, xDeepFM, DCN, DCNv2, DIN和DIEN。",
    "implementation_details": "所有基准方法均使用 ReChorus 库实现。为了确保公平比较，我们将所有模型的嵌入大小标准化为 64，批大小标准化为 2048。所有方法均使用 Adam 优化器进行优化，并在学习率 { 1 *𝑒* – 3 *,* 1 *𝑒* – 4 *,* 5 *𝑒* – 4 *,* 1 *𝑒* – 5 } 和权重衰减 { 1 *𝑒* – 5 *,* 1 *𝑒* – 6 *,* 1 *𝑒* – 7 } 上执行网格搜索，同时将其他超参数保留为 ReChorus 提供的默认设置。对于损失函数，我们对 top- 𝐾 推荐任务采用 BPR 损失，对 CTR 预测采用二元交叉熵 (BCE) 损失。所有实验均在 NVIDIA Tesla V100 32G GPU 上进行。"
  },
  "results": "Top-K推荐：当推荐项目是主播时，TiSASRec表现最佳。当推荐项目是直播间时，性能显著下降。CTR预测：当推荐项目是直播间而不是主播时，性能会下降。总体而言，大多数CTR模型的性能相对相似。",
  "result_analysis": "Top-K推荐：序列推荐方法在大多数情况下优于一般的协同过滤方法，时间感知方法优于非时间方法。推荐项目是直播间时性能下降是由于许多直播间缺乏互动历史。CTR预测：使用稀疏特征限制了模型利用更丰富的语义信息的能力。",
  "conclusions": "KuaiLive是一个有价值的资源，可以促进直播推荐的研究。对数据集的分析揭示了直播场景的独特特征，为设计更有效的推荐模型提供了见解。在KuaiLive上评估的代表性推荐和CTR预测方法建立了一个可靠且可重复的基准，为未来的研究奠定了基础。",
  "limitations": "该论文没有明确提及局限性，但可以推断出以下几点：\n*   数据收集的时间范围有限（21天），可能无法捕捉到长期趋势和季节性变化。\n*   数据集仅包含快手平台的数据，可能不适用于其他直播平台。\n*   匿名化过程可能会导致一些信息的丢失，从而影响模型的性能。\n*   实验中使用的是相对简单的基线模型，可能无法充分利用 KuaiLive 数据集的全部潜力。",
  "future_work": "基于 KuaiLive 数据集中提供的丰富用户行为和多粒度特征，本文总结了该数据集可以支持的一系列潜在研究方向：Top-K 推荐、XTR 预测、观看时间预测、礼物价格预测、多行为建模、可控学习和推荐、冷启动推荐、公平感知推荐、端到端生成推荐。",
  "applications": "这项研究可能的实际应用场景包括：\n*   提高直播推荐的准确性和个性化程度，从而增加用户观看时长和互动。\n*   优化平台资源分配，例如根据用户观看时长预测结果，合理分配服务器资源。\n*   改进主播推荐算法，帮助新主播获得更多曝光机会。\n*   制定更有效的直播营销策略，例如根据礼物价格预测结果，针对性地向用户推荐高价值礼物。",
  "related_work": "论文中提到了与直播推荐和相关数据集相关的研究工作。包括：\n*   LiveRec, LSEC, Klive: 现有的直播推荐数据集，但存在一些局限性，例如缺乏直播间生命周期信息、无法捕捉多样化的用户行为等。\n*   MTA, ContentCTR, LARM, MMBee: 专注于多模态信息融合，以提高推荐性能。\n*   LSEC-GNN, eLiveRec: 专注于电商直播推荐，利用用户、主播和商品之间的关系。\n*   LiveRec, MRB4LS, LiveForesighter: 专注于建模用户行为的时间动态性。",
  "github_links": [
    "https://imgkkk574.github.io/KuaiLive",
    "https://github.com/THUwangcy/ReChorus"
  ],
  "published": "2025-08-07T17:59:36+00:00"
}