{
  "title": "KuaiLive: A Real-time Interactive Dataset for Live Streaming Recommendation",
  "detailed_summary": "本文介绍了一个名为KuaiLive的真实互动直播推荐数据集，旨在解决学术界缺乏能够准确反映直播环境动态性的公开数据集的问题。该数据集来自中国领先的直播平台快手，包含了23772名用户和452621名主播在21天内的互动日志。KuaiLive相比现有数据集的优势在于：包含精确的直播间开始和结束时间戳，多种类型的实时用户互动（点击、评论、点赞、礼物），以及丰富的用户和主播的辅助信息特征。这些特征可以更真实地模拟动态候选项目，更好地建模用户和主播的行为。作者对KuaiLive进行了多角度的全面分析，并评估了几种具有代表性的推荐方法，为未来的研究建立了一个强大的基准。KuaiLive能够支持直播领域的各种任务，如top-K推荐、点击率预测、观看时长预测和礼物价格预测。",
  "background": "直播平台已成为一种主要的在线内容消费形式，提供动态演变的内容、实时互动和高度吸引人的用户体验。这些独特的特点带来了新的挑战，使直播推荐与传统的推荐设置不同，并近年来受到业界的越来越多的关注。然而，由于缺乏能够准确反映直播环境动态性的公开数据集，学术界的研究进展受到了阻碍。现有公开数据集主要关注短视频或一般内容推荐，无法全面捕捉直播的动态特性，例如主播和直播间只在广播期间活跃，内容和用户行为实时演变等。",
  "contributions": [
    "提出了KuaiLive，这是一个大规模的、真实的直播推荐数据集，来自快手平台，包含丰富的用户互动行为和辅助信息。",
    "KuaiLive数据集包含了直播间的开始和结束时间戳，可以模拟真实直播推荐场景中候选项目的动态变化。",
    "KuaiLive数据集记录了多种用户行为（点击、评论、点赞、礼物），可以用于研究多任务学习和多行为建模。",
    "KuaiLive数据集包含了用户观看时长和礼物价格，可以用于更广泛的研究任务，例如观看时长预测和礼物价格预测。",
    "对KuaiLive数据集进行了全面的分析，揭示了直播场景的独特特性，并为未来的研究提供了有价值的见解。"
  ],
  "problem": "现有的公开数据集无法全面捕捉直播推荐的动态特性，例如：直播间具有生命周期，仅在直播时活跃；用户行为和直播内容实时演变；缺乏用户在直播间的多种互动行为数据。因此，难以开发出适用于直播场景的有效且通用的推荐模型。",
  "methods": [
    "数据收集：从快手平台收集用户在直播间的点击、评论、点赞和送礼等行为数据，以及用户、主播和直播间的相关信息。",
    "数据清洗：过滤掉异常用户行为，并对数据进行匿名化处理，以保护用户隐私。",
    "数据分析：对数据集进行统计分析，包括用户、主播和直播间的数量、互动行为的分布、用户活跃时间和主播直播时间等。",
    "基准模型评估：在数据集上评估了多种推荐算法和点击率预测算法的性能，为未来的研究提供基准。"
  ],
  "experimental_design": {
    "数据集": "KuaiLive数据集，基于用户的点击行为进行实验。",
    "数据集划分": "对于Top-K推荐任务，采用leave-one-out策略划分数据集；对于CTR预测任务，按照时间戳将数据集划分为训练集、验证集和测试集，比例为8:1:1。",
    "评估指标": "Top-K推荐任务采用Recall@K和NDCG@K作为评估指标；CTR预测任务采用AUC和LogLoss作为评估指标。",
    "基准模型": "Top-K推荐任务选择了BPRMF, NeuMF, LightGCN, DirectAU, GRU4Rec, SASRec, NARM, Caser, TiSASRec等模型；CTR预测任务选择了FM, Wide&Deep, DeepFM, xDeepFM, DCN, DCNv2, DIN, DIEN等模型。"
  },
  "results": "实验结果表明，当推荐项目为直播间时，所有模型的性能都有显著下降，这表明直播间具有冷启动问题。TiSASRec在推荐主播的任务上表现最好，DirectAU在推荐直播间的任务上表现最好。Wide&Deep和DeepFM在CTR预测任务上表现相对较好。",
  "result_analysis": "当推荐项目为直播间时，由于直播间生命周期短，缺乏历史互动数据，导致模型难以准确预测用户偏好。时序模型在推荐主播时表现较好，因为用户倾向于观看相同或相关主播，具有时序性。点击率预测任务中，模型的性能相对接近，可能是因为匿名化限制了模型对更丰富语义信息的利用。",
  "conclusions": "KuaiLive是一个具有代表性的直播推荐数据集，它包含了丰富的用户互动行为和辅助信息，可以用于研究各种直播推荐任务。实验结果表明，直播推荐具有独特的挑战，例如冷启动问题和动态性，需要专门的模型来解决。",
  "limitations": "该研究使用了匿名化的数据，可能限制了某些依赖于原始数据的研究。此外，数据集只包含了21天的数据，可能无法捕捉到更长期的用户行为模式。",
  "future_work": [
    "利用KuaiLive数据集研究更先进的推荐算法，例如基于图神经网络的推荐算法。",
    "探索如何利用KuaiLive数据集解决直播推荐中的冷启动问题。",
    "研究如何利用KuaiLive数据集进行多目标优化，例如同时优化点击率和观看时长。",
    "将该数据集应用于公平推荐研究，解决头部主播占据大部分流量的问题。",
    "研究端到端生成推荐方法。"
  ],
  "applications": [
    "Top-K推荐：为用户推荐最感兴趣的直播间。",
    "点击率预测：预测用户点击直播间的概率。",
    "观看时长预测：预测用户在直播间的观看时长。",
    "礼物价格预测：预测用户在直播间送礼物的金额。",
    "多行为建模：根据用户的多种行为进行更精准的推荐。",
    "可控学习和推荐：根据实时情况调整推荐目标。",
    "冷启动推荐：为新用户推荐感兴趣的直播间。",
    "公平推荐：为更多主播提供曝光机会。",
    "端到端生成推荐：直接生成推荐结果。"
  ],
  "related_work": "论文中提到了与直播推荐相关的研究工作，包括利用多模态信息、图神经网络、跨域信息等方法进行推荐，以及现有的直播推荐数据集LiveRec, LSEC, Klive等。着重强调了KuaiLive数据集与现有数据集的差异和优势。",
  "github_links": [
    "https://imgkkk574.github.io/KuaiLive",
    "https://github.com/THUwangcy/ReChorus"
  ],
  "published": "2025-08-07T17:59:36+00:00"
}