{
  "title": "KuaiLive: A Real-time Interactive Dataset for Live Streaming Recommendation",
  "detailed_summary": "该论文介绍了KuaiLive，这是一个从快手平台收集的实时交互式直播推荐数据集。由于缺乏反映直播环境动态性的公开数据集，学术界在直播推荐领域的研究进展受到阻碍。KuaiLive数据集包含23,772名用户和452,621名主播在21天内的互动日志，提供了精确的直播间开始和结束时间戳、多种类型的实时用户互动（点击、评论、点赞、送礼）以及丰富的用户和主播辅助信息特征。这使得能够更真实地模拟动态候选项目，并更好地建模用户和主播的行为。论文对KuaiLive进行了多角度的全面分析，并在其上评估了几种具有代表性的推荐方法，为未来的研究建立了强大的基准。KuaiLive可以支持直播领域的各种任务，如Top-K推荐、点击率预测、观看时长预测和礼物价格预测。此外，其细粒度的行为数据还可以用于研究多行为建模、多任务学习和公平感知推荐。",
  "background": "随着短视频和直播平台的快速发展，直播已成为一种重要且新颖的在线服务形式，它将实时内容广播与即时社交互动无缝结合。然而，由于缺乏公开可用的、大规模且结构良好的数据集，学术界对直播推荐的研究明显不足，这阻碍了针对直播场景独特特征的有效且可泛化的推荐模型的发展。现有的公开推荐数据集主要关注短视频或一般内容推荐，未能充分捕捉直播环境的动态特性，例如主播和直播间仅在广播期间活跃、实时内容和用户行为的演变。",
  "contributions": [
    "提出了KuaiLive数据集，这是一个大规模的真实世界直播推荐数据集，包含来自快手平台的23,772名用户和452,621名主播的互动日志。",
    "KuaiLive提供了精确的直播间开始和结束时间戳，允许研究人员模拟真实的直播推荐场景，其中候选项目受到时间限制且动态变化。",
    "KuaiLive记录了多种用户行为（例如，点击、评论、点赞、送礼），可用于研究多任务学习和多行为建模。",
    "KuaiLive保留了每次互动的时间顺序，支持对用户行为轨迹进行细粒度分析。",
    "KuaiLive不仅包含用户和项目ID，还包含丰富的辅助信息特征，如人口统计数据和属性，从而促进了特征感知的建模。",
    "KuaiLive数据集包含正反馈和负反馈，适用于点击率(CTR)预测"
  ],
  "problem": "现有公开直播推荐数据集存在以下局限性：缺乏直播间生命周期信息，无法捕捉直播间内多样化的用户行为，以及仅限于ID级别的字段。这些限制阻碍了它们反映真实直播场景动态性的能力。此外，业界普遍使用私有数据集，这限制了研究的可重复性，并阻碍了学术界的进展。 因此，需要一个更具代表性的数据集，能够反映直播互动的真实复杂性。",
  "methods": [
    "数据收集：从快手平台收集用户行为数据，包括点击、评论、点赞和送礼等互动行为，以及用户观看时长和礼物价格等辅助信号，同时包括负反馈数据。",
    "数据清洗：过滤掉具有不规则或异常互动模式的用户，以保持数据集的质量。",
    "特征工程：收集用户、主播和直播间的辅助信息特征，包括人口统计数据、内容特征和行为总结等。",
    "匿名化：对用户ID、主播ID和直播间ID进行随机哈希，对时间戳信息进行偏移和舍入处理，对文本数据进行向量编码和降维，以保护用户隐私并符合数据发布政策。",
    "基线模型评估：在KuaiLive数据集上评估了多种具有代表性的推荐和CTR预测方法，包括协同过滤、序列推荐和时间感知推荐等，建立了可复现的基准。"
  ],
  "experimental_design": {
    "数据集": "KuaiLive数据集的点击行为数据，分别以直播间和主播为推荐对象。",
    "评估协议": "对于Top-K推荐，采用leave-one-out分割策略，并从候选池中抽样10,000个负样本；评估指标包括Recall@K和NDCG@K (K=5, 10, 20)。对于CTR预测，按时间戳将数据划分为训练集、验证集和测试集，比例为8:1:1；评估指标包括AUC和LogLoss。",
    "基准方法": "Top-K推荐：BPRMF, NeuMF, LightGCN, DirectAU, GRU4Rec, SASRec, NARM, Caser, TiSASRec。CTR预测：FM, Wide&Deep, DeepFM, xDeepFM, DCN, DCNv2, DIN, DIEN。",
    "实现细节": "所有基准方法均使用ReChorus库实现；嵌入大小设置为64，批大小设置为2048；使用Adam优化器，并对学习率和权重衰减进行网格搜索；Top-K推荐使用BPR损失，CTR预测使用二元交叉熵损失；序列推荐方法的最大用户互动历史长度设置为50；所有实验均在NVIDIA Tesla V100 32G GPU上进行。"
  },
  "results": "在Top-K推荐任务中，以主播为推荐对象时，TiSASRec表现最佳，其次是SASRec和DirectAU；以直播间为推荐对象时，DirectAU表现最佳。在CTR预测任务中，以主播为推荐对象时，Wide&Deep在AUC指标上表现最佳，DeepFM在LogLoss指标上表现最佳；以直播间为推荐对象时，DeepFM在AUC和LogLoss指标上均表现最佳。总体而言，推荐对象为直播间时，模型性能明显下降。",
  "result_analysis": "当推荐项目是主播时，LightGCN的性能比其他基于协同过滤的方法差，这可能是由于基于GNN的方法在大规模数据集上的可扩展性有限。此外，在大多数情况下，顺序推荐方法优于一般的基于协同过滤的方法。这可能归因于用户经常观看同一主播或相关主播，从而导致顺序行为模式，而顺序模型更善于捕捉这些模式。此外，时间感知方法（如TiSASRec）优于非时间基线，突出了在此场景中建模时间信号的重要性。鉴于实时场景中内容相关性和用户参与度的时间敏感性，结合时间动态性被证明特别有益。当推荐项目是直播间时，我们观察到性能显着下降。这可以归因于直播间仅在流媒体会话期间存在，并且其中许多直播间缺乏互动历史记录，使其成为冷启动项目。即使某个用户之前多次观看过同一主播，但仅根据新启动的直播间的ID仍然难以生成准确的推荐。此外，在这种设置下，基于协同过滤的方法优于顺序推荐模型。这是因为用户行为序列通常不反映同一主播的重复消费，这使得顺序模型更难以有效地捕捉用户偏好。",
  "conclusions": "KuaiLive是一个有价值的直播推荐研究资源，它记录了直播间的开始和结束时间戳，捕捉了直播间内的各种用户行为，并包括用户和主播的丰富特征。论文通过对数据集进行分析和基准测试，揭示了直播场景的独特特征，并为设计更有效的推荐模型提供了见解。该数据集可以支持多种研究方向，包括Top-K推荐、XTR预测、观看时长预测、礼物价格预测、多行为建模、可控学习和推荐、冷启动推荐和公平感知推荐。",
  "limitations": "该论文没有明确提及局限性，但可以推断出以下几点：数据集仅来自快手平台，可能无法完全代表所有直播平台的特点；由于隐私保护的原因，使用了一些匿名化处理，可能会影响模型的性能；数据集的时间跨度有限，可能无法捕捉到长期用户行为变化。",
  "future_work": "基于KuaiLive数据集，论文建议了以下未来研究方向：Top-K推荐，XTR预测，观看时长预测，礼物价格预测，多行为建模，可控学习与推荐，冷启动推荐，公平感知推荐，端到端生成式推荐。",
  "applications": "这项研究对直播推荐系统具有重要的实际应用价值。通过利用KuaiLive数据集，研究人员可以开发更有效的推荐算法，提高用户参与度和平台收入。此外，该数据集还可以用于分析用户行为模式、优化直播内容和改善用户体验。该研究还有助于解决直播平台面临的挑战，如冷启动问题、公平性问题和多样性问题。",
  "related_work": "论文中提到了与直播推荐相关的研究，包括：多模态融合方法（MTA, ContentCTR），利用大型语言模型的方法 (LARM), 基于图学习的方法 (MMBee)，电商直播推荐（LSEC-GNN, eLiveRec），重复消费建模 (LiveRec, MRB4LS)，内容演化建模 (Sliver, KuaiHL)，以及利用短视频数据增强直播推荐的方法 (Moment&Cross, FARM, MGCCDR)。论文还讨论了现有公开直播推荐数据集（LiveRec, LSEC, Klive）的局限性。",
  "github_links": [
    "https://imgkkk574.github.io/KuaiLive",
    "https://github.com/THUwangcy/ReChorus"
  ],
  "published": "2025-08-07T17:59:36+00:00"
}