{
  "title": "Towards Generalizable Safety in Crowd Navigation via Conformal Uncertainty Handling",
  "detailed_summary": "这篇论文提出了一种在人群导航中提高机器人安全性和泛化能力的方法。该方法通过准确量化行人轨迹预测的不确定性，并将其融入到强化学习的决策过程中，来减轻因环境分布变化导致的性能下降问题。具体来说，论文使用自适应共形推断（ACI）来估计行人轨迹预测的不确定性，并利用约束强化学习（CRL）来引导机器人的行为，使其能够适应分布变化。该系统通过将预测不确定性估计整合到智能体的观察中，并通过约束强化学习来指导智能体的行为，从而调节智能体的动作并使其能够适应分布的变化。实验结果表明，该方法在分布内和分布外场景中均优于现有的方法，并且在真实机器人上的部署也取得了成功，展示了在稀疏和密集人群中安全导航的能力。该方法通过考虑预测误差，提高了策略的泛化能力，具有重要的实际应用价值。",
  "background": "在人群中安全导航是机器人与人类紧密协作的关键。现有的强化学习方法在同分布场景中表现良好，但在分布外场景中性能显著下降，表明存在过拟合和难以泛化的问题。将预测信息融入观察虽然可以帮助机器人理解人类意图，但也可能加剧过拟合问题，因为真实世界中的人类行为复杂且难以完全捕捉。因此，缺乏对预测误差的系统性处理是现有方法的局限性。本文旨在通过量化人类轨迹预测的不确定性，并将其纳入决策算法中，来缓解基于强化学习的人群导航中的过拟合问题。",
  "contributions": [
    "提出了一种基于强化学习的人群导航框架，该框架集成了共形不确定性估计和约束强化学习，以减轻分布外性能下降。",
    "使用自适应共形推断（ACI）动态量化行人轨迹预测的不确定性，并生成包含真实未来位置的预测集。",
    "利用约束强化学习（CRL），通过引入行为层面的指导，有效地利用不确定性估计来引导机器人的行为，并解决稀疏约束反馈的问题。",
    "在各种分布外场景中进行了广泛的仿真实验，证明了该方法的鲁棒性和稳定性，包括速度变化、策略变化以及个体到群体动态的过渡。",
    "在真实机器人上部署了该方法，并在稀疏和密集人群中验证了其有效性和安全性。"
  ],
  "problem": "解决强化学习在人群导航中，机器人由于过拟合训练数据，导致在面对真实世界中复杂多变的人群行为时，泛化能力不足的问题。具体来说，需要解决以下挑战：1）如何准确量化人类轨迹预测的不确定性；2）如何将这种不确定性有效地融入到机器人的决策过程中，使其能够适应分布变化；3）如何保证机器人在导航过程中的安全性，避免与行人发生碰撞或侵犯其个人空间。",
  "methods": [
    "**轨迹预测:** 使用基于规则的恒定速度（CV）模型和基于学习的Gumbel Social Transformer（GST）预测器，以适应不同的预测模型，并减轻不正确预测对后续决策过程的不利影响。",
    "**不确定性量化:** 采用动态调整的自适应共形推断（DtACI）算法量化预测不确定性，DtACI 可以有效地适应分布变化，因此非常适合社交导航中的在线不确定性估计。",
    "**策略网络:** 利用带有组合注意力机制的策略网络处理这些不确定性以及其他特征。该网络包含用于人与人之间交互的人际注意力（H-H 注意力）和用于人和自我机器人之间交互的人机注意力（H-R 注意力）。",
    "**约束强化学习:** 采用约束强化学习（CRL）来增强可控性，并根据预定义的成本限制调整其分布。使用PPO Lagrangian进行优化，并设置两个评论家来计算奖励的状态值和成本的状态值。",
    "**成本函数设计:** 将行人的安全关键区域设计为围绕人类位置的圆形区域和围绕 *K* *[′]* ( *K* *[′]* *≤* *K* ) 步预测的不确定性区域的组合。"
  ],
  "experimental_design": "实验采用CrowdNav仿真环境，包含20个人类和一个机器人在12m×12m的区域内随机分布。机器人半径为0.2m，人类半径在0.3m到0.5m之间随机采样。机器人最大速度为1.0m/s。评估指标包括成功率（SR）、碰撞率（CR）、超时率（TR）、导航时间（NT）、路径长度（PL）、入侵时间比率（ITR）和社会距离（SD）。基线方法包括ORCA、SF、MPC、SafeCrowdNav和CrowdNav++。此外，论文还包括RL（w/o ACI）和RL（w/ ACI）作为消融模型。在分布内和分布外场景下进行了测试，分布外场景包括行人速度变化、策略变化和群体行为。",
  "results": "在同分布测试中，Ours (w/ GST) 的成功率比之前的SOTA RL基线高8.80%以上，碰撞次数减少3.72倍以上，对行人轨迹的入侵减少2.43倍以上。在三种不同的分布外测试场景中（速度变化、策略变化、行人分组行为），Ours (w/ GST) 保持了较高的成功率和较低的碰撞率，而其他方法性能显著下降。真实机器人实验表明，该策略可以直接从模拟转移，并在稀疏和密集人群中实现安全导航。",
  "result_analysis": "实验结果表明，该方法通过有效处理预测不确定性，提高了机器人在复杂人群环境中的安全性和泛化能力。在分布外场景中，ACI能够动态调整不确定性估计，帮助机器人更好地适应环境变化。CRL的使用使得机器人能够在保证安全的前提下，尽可能地完成导航任务。此外，消融实验也验证了ACI和CRL在提高性能方面的重要性。",
  "conclusions": "论文提出了一种基于强化学习的轨迹规划框架，该框架将共形不确定性融入到约束强化学习方案中，以减轻分布外性能下降。与传统的强化学习规划器不同，该方法动态地利用不确定性估计来适应速度变化、策略变化以及个体到群体动态的转变。大量的模拟实验证明了在各种分布外场景中的鲁棒稳定性，而真实世界的试验证实了该方法的实际有效性。",
  "limitations": "论文的局限性包括：1）该方法主要关注于密集人群环境中的安全导航，对于任意形状的静态障碍物，需要额外的感知和建图能力；2）感知误差（如人类漏检和2D激光雷达对光照的敏感性）会影响性能；3）虽然该策略有效地缓解了分布外性能下降，但尚未完全消除；4）虽然评估了三种代表性的分布偏移场景：速度变化、策略变化以及从个体到群体层面的动态变化，但可能的分布偏移空间是巨大的，无法进行详尽的测试。",
  "future_work": "未来的研究方向包括：1）集成SLAM，并将多模态观测输入到策略网络，以处理任意形状的静态障碍物；2）通过增加摄像头和升级到更高频率、更强大的激光雷达，应用传感器融合技术，提高感知鲁棒性；3）采用更大的模型（如LLM或VLM）和高级对齐方法，进一步消除分布外性能下降；4）在解决静态障碍物处理问题后，进行更大规模的真实世界实验。",
  "applications": "这项研究的实际应用场景包括：1）服务型机器人：在商场、医院等公共场所为人们提供导航和引导服务；2）物流机器人：在仓库和配送中心安全高效地搬运货物；3）自动驾驶：提高自动驾驶车辆在拥挤城市环境中的安全性；4）辅助机器人：在养老院或家庭中帮助老年人或残疾人进行移动。",
  "related_work": "论文中提到了与人群导航、不确定性下的规划等相关的研究工作。具体包括：基于规则的方法（如ORCA、SF）、基于优化的规划器、强化学习方法以及混合系统。此外，还讨论了将预测信息融入观察的研究，以及在优化和搜索方法中整合感知和预测不确定性的研究。",
  "github_links": [
    "https://gen-safe-nav.github.io/"
  ],
  "published": "2025-08-07T17:59:43+00:00"
}