{
  "title": "KuaiLive: A Real-time Interactive Dataset for Live Streaming Recommendation",
  "detailed_summary": "这篇论文介绍了KuaiLive，这是一个从中国领先的直播平台快手收集的实时交互数据集，旨在弥补学术界在直播推荐研究中缺乏公开数据集的空白。KuaiLive记录了23772名用户和452621名主播在21天内的互动日志，包含了直播间的精确开始和结束时间戳，以及多种类型的实时用户互动（点击、评论、点赞、送礼）。该数据集还提供了用户和主播的丰富侧信息特征，能够更真实地模拟动态候选项目，并更好地建模用户和主播的行为。论文对KuaiLive进行了多角度的全面分析，并在其上评估了几种具有代表性的推荐方法，为未来的研究建立了强大的基准。KuaiLive支持直播领域的多种任务，如Top-K推荐、点击率预测、观看时长预测和礼物价格预测，其细粒度的行为数据也支持多行为建模、多任务学习和公平感知推荐。",
  "background": "直播平台已成为在线内容消费的主要形式，具有动态演进的内容、实时互动和高度吸引用户的体验等独特特征。这些特性使得直播推荐与传统推荐场景有所不同，近年来受到工业界越来越多的关注。然而，由于缺乏能够准确反映直播环境动态性的公开数据集，学术界的研究进展受到阻碍。现有公开数据集主要集中于短视频或一般内容推荐，无法全面捕捉直播场景的动态特性，例如主播和直播间的活跃期限制、实时变化的用户行为等。因此，亟需一个更具代表性的数据集来反映直播互动的复杂性。",
  "contributions": [
    "提出了KuaiLive数据集，这是一个大规模、真实世界的直播推荐数据集，从快手平台收集。",
    "KuaiLive包含了直播间的开始和结束时间戳，允许研究者模拟真实的直播推荐设置，其中候选项目在时间上受到约束且动态变化。",
    "KuaiLive记录了多种用户行为（例如，点击、评论、点赞、送礼），可用于研究多任务学习和多行为建模。",
    "KuaiLive保留了每次互动的时序顺序，支持对用户行为轨迹进行细粒度分析。",
    "KuaiLive不仅包括用户观看时长和礼物价格，还支持推荐以外的更广泛的研究任务，例如观看时长和礼物价格预测。",
    "KuaiLive提供了用户和项目的丰富侧信息特征，方便进行特征感知的建模。"
  ],
  "problem": "论文旨在解决学术界缺乏公开、大规模且结构良好的直播推荐数据集的问题，现有数据集无法全面捕捉直播场景的动态性、实时性和互动性，阻碍了直播推荐算法的学术研究和发展。",
  "methods": [
    "**数据收集：** 从快手平台收集用户在直播间的多种互动行为，包括点击、评论、点赞和送礼，并记录精确的时间戳。",
    "**用户抽样：** 随机抽取约25000名活跃用户，他们参与了所有四种类型的互动，并过滤掉不规则或异常的互动模式。",
    "**侧信息收集：** 收集用户、主播和直播间的丰富侧信息，包括人口统计学特征、内容特征和行为总结等。",
    "**匿名化：** 对所有标识符（如用户ID、主播ID和直播间ID）进行随机哈希，对敏感时间戳信息应用系统偏移和舍入技术，使用预训练的嵌入模型将文本数据编码成密集向量并降维。"
  ],
  "experimental_design": {
    "数据集": "KuaiLive数据集，基于点击行为进行实验。",
    "评估协议": "对于Top-K推荐方法，采用标准的留一法分割策略，不使用用户或项目特征。对于CTR预测方法，将正负样本合并，并按互动时间戳以8:1:1的比例分割数据为训练集、验证集和测试集。",
    "评估指标": "Top-K推荐使用Recall@{5, 10, 20}和NDCG@{5, 10, 20}。CTR预测使用曲线下面积（AUC）和LogLoss。",
    "基线方法": "Top-K推荐选择通用协同过滤方法（BPRMF、NeuMF、LightGCN、DirectAU），序列方法（GRU4Rec、SASRec、NARM、Caser）和时间感知方法（TiSASRec）。CTR预测选择FM、Wide&Deep、DeepFM、xDeepFM、DCN、DCNv2、DIN和DIEN。",
    "实现细节": "所有方法都使用ReChorus库实现。嵌入大小标准化为64，批大小为2048。使用Adam优化器，学习率和权重衰减进行网格搜索。Top-K推荐使用BPR损失，CTR预测使用二元交叉熵损失。序列推荐方法的最大用户互动历史长度设置为50。所有实验都在NVIDIA Tesla V100 32G GPU上进行。"
  },
  "results": {
    "Top-K推荐": "当推荐项目是主播时，LightGCN的性能低于其他基于协同过滤的方法，可能是由于基于GNN的方法在大规模数据集上的可扩展性有限。序列推荐方法在大多数情况下优于基于通用协同过滤的方法。时间感知方法（如TiSASRec）优于非时间基线，强调了在此场景中建模时间信号的重要性。当推荐项目是直播间时，性能显著下降。",
    "CTR预测": "CTR预测任务中，当推荐项目是直播间而不是主播时，性能会下降，特别是对于严重依赖用户历史行为序列的模型（如DIN和DIEN）。大多数CTR模型的性能相对相似，可能是由于仅使用了稀疏特征，限制了模型利用更丰富的语义信息的能力。"
  },
  "result_analysis": "Top-K推荐中，时间感知方法优于非时间感知方法，表明时间因素对直播推荐至关重要。当推荐直播间时，由于直播间存在时间限制和互动历史稀疏，导致性能下降，这表明建模直播间和主播之间的关系非常重要。CTR预测中，性能普遍下降是因为直播间本身的特点导致模型难以有效学习。",
  "conclusions": "论文提出了KuaiLive数据集，记录了直播间的开始和结束时间戳，捕捉了直播间内的各种用户行为，并包含了用户和主播的丰富特征。KuaiLive比现有的数据集更具代表性，能更好地模拟真实世界的直播推荐场景。通过对数据集的分析和实验，揭示了直播场景的独特特征，为设计更有效的推荐模型提供了见解。",
  "limitations": "论文中提到的局限性主要体现在数据集的匿名化处理上，为了保护用户隐私，论文中使用了稀疏特征，这限制了模型利用更丰富的语义信息的能力。此外，虽然数据集规模较大，但某些互动行为（如送礼）仍然非常稀疏，给相关任务的建模带来了挑战。",
  "future_work": "论文提出了多个潜在的研究方向，包括Top-K推荐、XTR预测、观看时长预测、礼物价格预测、多行为建模、可控学习与推荐、冷启动推荐、公平感知推荐和端到端生成推荐。这些方向涵盖了直播推荐领域的多个重要方面，为未来的研究提供了指导。",
  "applications": "这项研究的实际应用场景包括：\n\n*   **Top-K推荐：** 为用户推荐最感兴趣的直播间，提高用户留存和活跃度。\n*   **XTR预测 (CTR、GTR等)：** 预测用户点击、送礼等行为的概率，优化推荐策略和广告投放。\n*   **观看时长预测：** 预测用户在直播间的停留时间，用于个性化调度和服务器资源分配。\n*   **礼物价格预测：** 预测用户潜在的礼物消费金额，优化商业变现策略。\n*   **公平推荐：** 提升新主播或小众主播的曝光度，构建更健康的直播生态。\n\n这些应用能够提升用户体验，增加平台收入，并促进直播生态的可持续发展。",
  "related_work": "论文提到了与直播推荐相关的研究工作，包括多模态融合、电商直播推荐、重复消费建模和短视频与直播的交叉推荐。此外，论文还讨论了现有的直播推荐数据集，如LiveRec、LSEC和KLive，并指出了它们的局限性，强调了KuaiLive的优势。",
  "github_links": [
    "https://imgkkk574.github.io/KuaiLive",
    "https://github.com/THUwangcy/ReChorus"
  ],
  "published": "2025-08-07T17:59:36+00:00"
}